-------------------------------------------------------------------------------------------------
--실습 오라클 조인, ANSI JOIN(JOIN ON, JOIN USING) 까지 --INNER 조인까지만
--
--01. 사번, 성, 부서코드, 부서명, 위치코드, 도시 조회 --106

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--02. 사번이 110, 130, 150 인 사원들의 사번, 성, 부서명 조회 --3

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--03. 사번, 성명, 관리자사번, 관리자 성명, 관리자업무코드 조회 --106, SELF JOIN

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--04. 성이 king 인 사원의 사번, 성명, 부서코드, 부서명 조회 --2

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--05. 관리자 사번이 149 번인 사원의 
--사번, 성, 부서코드, 부서명 조회 --5

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--06. 위치코드 1400인 도시명, 부서명 조회 --1

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--07. 위치코드 1800에 근무하는 사원들의 
--사번, 성, 업무코드, 부서명, 위치코드 조회 --2

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--08. 성에 대소문자 무관하게 z가 있는 사원들의 
--사번, 성, 부서명 조회 --5

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--09. 관리자보다 먼저 입사한 사원의 
--사번, 성, 입사일자, 관리자사번, 
--관리자성, 관리자입사일자 조회 --37

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--10. 업무코드가 clerk종류의 업무형태인 사원들의 
--사번, 성, 부서명, 업무제목 조회 --45

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



--11. toronto 에 근무하는 
--사번, 성, 부서코드, 부서명, 도시명 조회 --2

오라클 조인



ANSI 조인 JOIN ON



ANSI 조인 JOIN USING



-------------------------------------------------------------------------------------------------